{
  "name": "Anirban Saha",
  "age": 20,
  "description": "Hello there! 👋 I am a B.Tech CSE '26 undergraduate student at Bengal\nCollege of Engineering and Technology (BCET), Durgapur, West Bengal. I am\nvery passionate about coding and love solving problems. I am a full\nstack developer and I love computer science!",
  "socials": {
    "linkedin": "https://www.linkedin.com/in/anirban-saha-245640256?utm_source=share&utm_campaign=share_via&utm_content=profile&utm_medium=android_app",
    "twitter": "https://x.com/TheFastest599?t=H4qU5U8gNTFAC535YR2nJQ&s=09",
    "github": "https://github.com/TheFastest599",
    "instagram": "https://www.instagram.com/anirban_saha_t?igsh=bm00dWtpbGh4cnhv"
  },
  "email": "ribhusaha2003@gmail.com",
  "phone": "+91 9395098694",
  "bigDp": "/assests/profile-pic-new.jpg",
  "smallDp": "/assests/small-profile.png",
  "contactMeDescription": "Thank You for visiting my Portfolio Website!!🤗🤗 If you are interested in working with me, please feel free to reach out to me. I am always open to new opportunities and challenges. Connect with me over the socials or drop me an email. I will get back to you as soon as possible.",
  "skills": {
    "HTML": {
      "name": "HTML",
      "image": "/assests/skills/html.png"
    },
    "CSS": {
      "name": "CSS",
      "image": "/assests/skills/css.png"
    },
    "Javascript": {
      "name": "Javascript",
      "image": "/assests/skills/javascript.png"
    },
    "React.js": {
      "name": "React.js",
      "image": "/assests/skills/react.png"
    },
    "Next.js": {
      "name": "Next.js",
      "image": "/assests/skills/nextjs.png"
    },
    "Bootstrap": {
      "name": "Bootstrap",
      "image": "/assests/skills/bootstrap.png"
    },
    "Tailwind CSS": {
      "name": "Tailwind CSS",
      "image": "/assests/skills/tailwindcss.png"
    },
    "Node.js": {
      "name": "Node.js",
      "image": "/assests/skills/nodejs.png"
    },
    "Express.js": {
      "name": "Express.js",
      "image": "/assests/skills/express.png"
    },
    "Python": {
      "name": "Python",
      "image": "/assests/skills/python.png"
    },
    "Flask": {
      "name": "Flask",
      "image": "/assests/skills/flask.png"
    },
    "Fast API": {
      "name": "Fast API",
      "image": "/assests/skills/fastapi.png"
    },
    "Django": {
      "name": "Django",
      "image": "/assests/skills/django.png"
    },
    "Pandas Python": {
      "name": "Pandas Python",
      "image": "/assests/skills/pandas.png"
    },
    "MongoDB": {
      "name": "MongoDB",
      "image": "/assests/skills/mongodb.png"
    },
    "MySQL": {
      "name": "MySQL",
      "image": "/assests/skills/mysql.png"
    },
    "PostgreSQL": {
      "name": "PostgreSQL",
      "image": "/assests/skills/postgresql.png"
    },

    "GitHub": {
      "name": "GitHub",
      "image": "/assests/skills/github.png"
    },
    "Git": {
      "name": "Git",
      "image": "/assests/skills/git.png"
    },
    "Docker": {
      "name": "Docker",
      "image": "/assests/skills/docker.png"
    },
    "Nginx": {
      "name": "Nginx",
      "image": "/assests/skills/nginx.png"
    },
    "Firebase": {
      "name": "Firebase",
      "image": "/assests/skills/firebase.png"
    },
    "C": {
      "name": "C",
      "image": "/assests/skills/c.png"
    }
  },
  "technologies": [
    "HTML",
    "CSS",
    "Javascript",
    "React.js",
    "Next.js",
    "Bootstrap",
    "Tailwind CSS",
    "Node.js",
    "Express.js",
    "Python",
    "Flask",
    "Fast API",
    "Django",
    "Pandas Python",
    "MongoDB",
    "MySQL",
    "PostgreSQL",
    "GitHub",
    "Git",
    "Docker",
    "Nginx",
    "Firebase",
    "C"
  ],
  "projects": {
    "Meridian Voyage": {
      "name": "Meridian Voyage - Internship Project",
      "description": " Meridian Voyage is a comprehensive data analytics company specializing in prescriptive, diagnostic, descriptive, and predictive analytics. We empower businesses with intelligent insights to make data-driven decisions, with a strong focus on US stock market data.\n My responsibilities and contributions include:\n - Designed and developed the entire frontend of the platform using React.js and Daisy UI, ensuring a responsive, modern, and intuitive user interface.\n - Built interactive visualizations and graphs to present complex stock market trends and financial data clearly.\n - Developed robust RESTful APIs using Django, integrated with a PostgreSQL database optimized for handling large-scale stock data.\n - Created datasets via web scraping and automated bot technologies to collect up-to-date financial data.\n - Conducted data analysis using Python libraries and built Business Intelligence dashboards to help clients derive actionable insights.\n - Set up the Docker configuration, deployed a complete client environment, configured the Nginx server, and enabled HTTPS for production.\n - Implemented secure email authentication systems, including signup, password reset, and email verification workflows.\n",
      "image": "/assests/projects/meridianvoyage.jpg",
      "stack": [
        "Python",
        "Django",
        "Docker",
        "Nginx",
        "React.js",
        "Daisy UI",
        "PostgreSQL"
      ],
      "video": "https://www.youtube.com/watch?v=WlCMqtsla1k"
    },
    "FlowTrack": {
      "name": "FlowTrack",
      "description": "The ultimate enterprise project and task management system. Manage teams, track progress, and boost productivity with our scalable, secure platform.",
      "image": "/assests/projects/flowtrack.jpg",
      "stack": [
        "Next.js",
        "Python",
        "Fast API",
        "PostgreSQL",
        "Docker",
        "Zustand",
        "Tanstack Query"
      ],
      "github": "https://github.com/TheFastest599/flowtrack",
      "live": "https://flowtrack-one.vercel.app",
      "video": "https://youtu.be/ZEyKh5ad7Pk"
    },
    "ParcelPro": {
      "name": "ParcelPro",
      "description": "ParcelPro is a courier management system built using the MERN stack (MongoDB, Express.js, React.js, Node.js). It streamlines courier operations with features like secure user authentication, order placement and tracking, real-time status updates, and email notifications. Designed to improve operational efficiency and user experience, ParcelPro is a modern solution for the logistics industry.",
      "image": "/assests/projects/parcelpro.jpg",
      "stack": ["React.js", "Node.js", "Express.js", "MongoDB", "Tailwind CSS"],
      "github": "https://github.com/TheFastest599/ParcelPro",
      "live": "https://parcelpro.onrender.com"
    },
    "My Notebook": {
      "name": "MyNotebook",
      "description": "Your notebook to save your Notes,Todos and Email Reminders in the cloud! MyNotebook, your go-to platform for streamlined note-taking, task management, and future planning. Powered by the MERN (MongoDB, Express.js, React, Node.js) stack, our small but mighty project is designed to simplify your daily life by providing a seamless and efficient way to organize your thoughts, tasks, and reminders.",
      "image": "/assests/projects/mynotebook.jpg",
      "stack": ["React.js", "Node.js", "Express.js", "MongoDB", "Bootstrap"],
      "github": "https://github.com/TheFastest599/mynotebook",
      "live": "https://mynotebook-backend-817b.onrender.com"
    },
    "Code Vision Website": {
      "name": "Code Vision Website",
      "description": "Code Vision is a coding club at Bengal College of Engineering and Technology (BCET), Durgapur. This club serves as a platform for students to learn and enhance their coding skills through various events, workshops, and seminars. It provides information about upcoming events, resources, and a community for coding enthusiasts. The website is easily discoverable on Google under keywords such as 'Code Vision BCET', 'BCET Code Vision', and similar search terms.",
      "image": "/assests/projects/codevision.jpg",
      "stack": ["React.js", "Tailwind CSS", "Firebase"],
      "github": "",
      "live": "https://codevision-bcet.web.app/"
    },

    "Markdown Render": {
      "name": "Markdown Render",
      "description": "Markdown Render is a dedicated markdown reader designed for developers and students. It allows users to load and read markdown notes, research papers, and documentation with a clean reading-focused interface. The application features advanced LaTeX rendering to fix broken math formulas often found in AI-exported markdown files, along with syntax highlighting and diagram support. Built with Next.js, React, Tailwind CSS, DaisyUI, KaTeX, Prism.js, and Mermaid, it provides a seamless reading experience with persistent sessions and PDF export.",
      "image": "/assests/projects/markdownrender.jpg",
      "stack": ["Next.js", "Tailwind CSS"],
      "github": "https://github.com/TheFastest599/markdown-render",
      "live": "https://markdownrender.vercel.app"
    },

    "Vehicle Tracker": {
      "name": "Vehicle Tracker",
      "description": "Advanced Real-time Vehicle Tracking System powered by authentic GPX route data from Bengal College of Engineering and Technology to Durgapur Railway Station. Experience realistic vehicle simulation using actual GPS coordinates recorded from a real journey.",
      "image": "/assests/projects/vehicletracker.jpg",
      "stack": ["React.js", "Tailwind CSS"],
      "github": "https://github.com/TheFastest599/vehicle-tracker",
      "live": "https://vehicle-tracker-anirban.netlify.app"
    },
    "DOST Web": {
      "name": "DOST Web",
      "description": "DOST - Your Virtual Assistant Companion! Your reliable virtual assistant designed to simplify your daily tasks and enhance your productivity on the Windows platform. (Windows App currently in development)",
      "image": "/assests/projects/dost.jpg",
      "stack": ["HTML", "CSS", "Javascript", "Bootstrap", "Python", "Flask"]
    },
    "Jhagmag LED Controller": {
      "name": "Jhagmag LED Controller",
      "description": "Jhagmag is an Arduino-based LED controller designed for vibrant, customizable lighting effects. Utilizing an HC-05 Bluetooth module and optional push-button functionality, it offers control over a variety of LED patterns and effects. A Python GUI, developed with PyQt6, provides an intuitive interface for adjusting patterns, colors, and settings. For enhanced portability and durability, the hardware is assembled on a dot matrix board and enclosed in a custom housing.",
      "image": "/assests/projects/jhagmag.jpg",
      "stack": ["Python", "Arduino", "PyQt6"],
      "github": "https://github.com/N00BSC00B/Jhagmag-LED-Controller",
      "live": "https://www.youtube.com/watch?v=UNQXKmhpDMk"
    },
    "Library Management System ": {
      "name": "Library Management System",
      "description": "This is a simple console-based Library Management System implemented in the C programming language. The program allows users to perform various library-related tasks, such as borrowing books, returning books, adding books to the inventory, deleting books, and displaying the available books.",
      "image": "/assests/projects/librarymanagementsystem.jpg",
      "stack": ["C", "CSV"],
      "github": "https://github.com/TheFastest599/library-managenent-system"
    },
    "TextUtils": {
      "name": "TextUtils",
      "description": "TextUtils gives you a way to analyze your text quickly and efficiently. Be it word count , character count etc.TextUtils is a free character counter tool that provides instan character count and statistics for a a given text. TextUtils reports the number of words and characters. Thus it is suitable for writing text with word/character limit.",
      "image": "/assests/projects/textutils.jpg",
      "stack": ["React.js", "Node.js", "Bootstrap"],
      "github": "https://github.com/TheFastest599/textutils",
      "live": "https://textutils1001.netlify.app"
    },
    "NewsMonkey": {
      "name": "NewsMonkey - News App",
      "description": "NewsMonkey is a news app that provides the latest news from around the world. The app is powered by the NewsAPI, which allows users to search for news articles by keyword, category, or source. Users can read news according to their preferences and stay updated with the latest happenings.",
      "image": "/assests/projects/newsmonkey.jpg",
      "stack": ["React.js", "Node.js", "Bootstrap"],
      "github": "https://github.com/TheFastest599/NewsMonkey-newsapp"
    },
    "Hospital Management System": {
      "name": "Hospital Management System",
      "description": "Health Wings Hospital Management System (Class 12 Project) is a GUI-based application developed in Python using TkInter for the interface, Pandas for data manipulation, and CSV for data storage. The system is designed to streamline the process of bed booking and patient record management in a hospital setting.",
      "image": "/assests/projects/hospital-management-system.jpg",
      "stack": ["Python", "TkInter", "Pandas", "CSV"],
      "github": "https://github.com/TheFastest599/HOSPITAL-MANAGEMENT-SYSTEM"
    },
    "Task Master": {
      "name": "Task Master - Flask App",
      "description": "Task Master is a simple task management app built using the Flask web framework. The app allows users to create, update, and delete tasks. ",
      "image": "/assests/projects/taskmaster.jpg",
      "stack": ["Python", "Flask", "HTML", "CSS"],
      "github": "https://github.com/TheFastest599/Python-Flask-Task-Master"
    },
    "Pig Game": {
      "name": "Pig Game",
      "description": "Pig Game is a simple dice game that can be played by two players. The game is played with a single six-sided die. The objective of the game is to be the first player to reach a total score of 100 or more points. Players take turns rolling the die and accumulating points.The player can choose to 'Hold', which means that his ROUND score gets added to his GLOBAL score. After that, it's the next player's turn. However, if a player rolls a 1, they lose all their points for that turn and the next player takes their turn.",
      "image": "/assests/projects/piggame.jpg",
      "stack": ["HTML", "CSS", "Javascript"],
      "github": "https://github.com/TheFastest599/pig-game",
      "live": "https://pig-game-202.netlify.app"
    },
    "Guess My Number": {
      "name": "Guess My Number",
      "description": "Guess My Number is a simple number guessing game where the player has to guess a number between 1 and 20. The player has a total of 20 attempts to guess the correct number. After each guess, the game provides feedback to the player, indicating whether the correct number is higher or lower than the guess. The game also keeps track of the player's high score, which is the lowest number of attempts taken to guess the correct number.",
      "image": "/assests/projects/guessmynumber.jpg",
      "stack": ["HTML", "CSS", "Javascript"],
      "github": "https://github.com/TheFastest599?tab=repositories",
      "live": "https://guess-my-number111.netlify.app"
    }
  },
  "education": {
    "college": {
      "name": "Bengal College of Engineering & Technology",
      "description": "Bengal College of Engineering & Technology (BCET) is a private engineering college located in Durgapur, West Bengal. The college is affiliated with the Maulana Abul Kalam Azad University of Technology (MAKAUT) and offers a variety of undergraduate and postgraduate programs in engineering and technology.",
      "link": "https://bcetdgp.ac.in",
      "image": "/assests/education/bcet.png",
      "period": "2022 - 2026 | Pursuing B.Tech in Computer Science & Engineering",
      "grade": "7.73 - 1st Sem | 7.66 - 2nd Sem | 7.82 - 3rd Sem | 6.48 - 4th Sem | 7.75 - 5th Sem | 7.68 - 6th Sem "
    },
    "school": {
      "name": "Maharishi Vidya Mandir Senior Secondary School, Silpukhuri,Guwahati",
      "description": "Maharishi Vidya Mandir (MVM) School, Guwahati is a part of Maharishi Global Education Movement. The school is affiliated to Central Board of Secondary Education, New Delhi up to Senior Secondary level.",
      "link": "https://mvmguwahati-1.org",
      "image": "/assests/education/maharshi-vidya-mandir.png",
      "period": "2010 - 2022 | Class 12 (Science)",
      "grade": "Class 10 - 92.4% | Class 12 - 82.8%"
    }
  },
  "experience": {
    "1": {
      "period": "September 2024 - Present",
      "tittle": "Web Development Lead at GDG On Campus BCET",
      "description": "As the Web Development Team Lead for Google Developer Groups on Campus BCET, I bring a solid foundation in web development acquired through my college studies. I am eager to lead and inspire a community of talented developers, leveraging my skills to create innovative and impactful projects. Let's build something extraordinary together!"
    },
    "2": {
      "period": "August 2024 - Present",
      "tittle": "Organiser at Code Vision BCET",
      "description": "At Code Vision, Bengal College of Engineering & Technology (BCET), Durgapur, I serve as a Organiser. My role involves organizing a variety of coding events, workshops, and seminars to foster a strong coding environment among the student body."
    },
    "3": {
      "period": "January 2024",
      "tittle": "2nd in CODE OF DUTY and 3rd in CODE ERROR",
      "description": "I secured 2nd podition in CODE OF DUTY and 3rd position in CODE ERROR of the event CYBERVERSE 2024 organised by Cybercell Club of BCET."
    },
    "4": {
      "period": "November 2023",
      "tittle": "Coordinator at Code Vision BCET",
      "description": "At Code Vision, Bengal College of Engineering & Technology (BCET), Durgapur, I serve as a Coordinator. My role involves organizing a variety of coding events, workshops, and seminars to foster a strong coding environment among the student body."
    },
    "5": {
      "period": "October 2023",
      "tittle": "Swachh Bharat Ekk kadam swachhta ki oar event by NSS BCET",
      "description": "I participated in the Swachh Bharat Ekk kadam swachhta ki oar event organised by the NSS BCET. The event was aimed at promoting cleanliness and hygiene in the local community."
    },
    "6": {
      "period": "September 2023",
      "tittle": "Member of NSS BCET",
      "description": "I joined the National Service Scheme (NSS) at Bengal College of Engineering & Technology (BCET), Durgapur, in September 2023. I am actively involved in various social service activities ."
    },
    "7": {
      "period": "September 2023",
      "tittle": "Volunteering in FIESTA 2K23",
      "description": "I volunteered in FIESTA 2K23 organised by the Enterpreneurship Development Cell(EDC) of BCET. The event was aimed at promoting innovation and entrepreneurship among students."
    },
    "8": {
      "period": "September 2023",
      "tittle": "2nd in CODEJAM HACKATHON",
      "description": "Our team (Edgerunners) secured 2nd place in the CODEJAM HACKATHON  organised by the CODE VISON Club of BCET."
    },
    "9": {
      "period": "April 2023 - Present",
      "tittle": "Coordinater at EDC BCET",
      "description": "I am currently working as a Coordinater at Entrepreneurship Development Cell, Bengal College of Engineering & Technology (BCET), Durgapur. I take part in organizing various events, workshops, and seminars to promote entrepreneurship and innovation among students."
    }
  },
  "experienceNew": [
    {
      "organisation": "Meridian Voyage",
      "logo": "/assests/experience/meridian_voyage.jpg",
      "duration": "February 2025 - May 2025",
      "link": "https://www.meridianvoyage.com",
      "positions": [
        {
          "period": "February 2025",
          "tittle": "Python Developer Intern",
          "description": "As a Python Intern at Meridian Voyage, I primarily focus on building modern, responsive, and user-friendly client-side applications and dashboards. Leveraging my expertise in web development, I design and implement intuitive interfaces that enhance user experience. In addition to front-end development, I contribute to backend integration by building APIs using Python to streamline data communication and integration between systems. I have also worked on creating datasets through web scraping and bot technologies, enabling efficient data collection. Furthermore, I utilize Python libraries such as Pandas and NumPy for data analysis and design dashboards for Business Intelligence, providing actionable insights and visual representations to support decision-making processes."
        }
      ]
    },
    {
      "organisation": "Google Developer Groups on Campus BCET",
      "logo": "/assests/experience/gdg_bcet.jpg",
      "duration": "September 2024 - Present",
      "link": "https://gdg.community.dev/gdg-on-campus-bengal-college-of-engineering-and-technology-durgapur-india/",
      "positions": [
        {
          "period": "September 2024",
          "tittle": "Web Lead",
          "description": "As the Web Development Team Lead for Google Developer Groups on Campus BCET, I bring a solid foundation in web development acquired through my college studies. I am eager to lead and inspire a community of talented developers, leveraging my skills to create innovative and impactful projects. Let's build something extraordinary together!"
        }
      ]
    },
    {
      "organisation": "Code Vision BCET",
      "logo": "/assests/experience/code_vision.jpg",
      "duration": "November 2023 - Present",
      "link": "https://codevision-bcet.web.app",
      "positions": [
        {
          "period": "August 2025",
          "tittle": "Governor",
          "description": "As the Governor of Code Vision at Bengal College of Engineering & Technology (BCET), Durgapur, I lead the organization in fostering a vibrant coding culture among students. My role involves overseeing the planning and execution of various coding events, workshops, and seminars to enhance the technical skills and knowledge of our members. I am dedicated to creating an inclusive and engaging environment that encourages collaboration, innovation, and continuous learning within the coding community."
        },
        {
          "period": "August 2024",
          "tittle": "Organiser",
          "description": "At Code Vision, BCET, I take the lead in organizing coding events, workshops, and seminars to cultivate a vibrant and engaging coding culture among students."
        },
        {
          "period": "November 2023",
          "tittle": "Coordinator",
          "description": "At Code Vision, BCET, I serve as a Coordinator, organizing coding events, workshops, and seminars to foster a strong coding culture among students."
        }
      ]
    }
  ],

  "resume": "/assests/Anirban Saha Resume.pdf"
}
